{"reviewerID": "A3MQ15651KGVLJ", "asin": "B00I93BOZ0", "reviewerName": "Rick L. Parrish", "helpful": [0, 0], "reviewText": "Nice addition to the interior of any hot teens car...well let me put that another way...not a hot teen...but a teen's hot car!  It installs in fifteen minutes if you're at all adept and it really makes for a kewl light show right inside the car or truck or tank or what have you.  I suggest parking before indulging but that's just common sense and unlike others I still credit the younger generation with having some.  Anyway the point is it really does trick out well!  I'd buy it!!", "overall": 5.0, "summary": "Tricks Out Well", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}
{"reviewerID": "AM9APPMIE1BHZ", "asin": "B00I93BOZ0", "reviewerName": "Sparky Jones", "helpful": [1, 1], "reviewText": "While most will probably install these inside the cabin of their vehicle, I used them to illuminate my truck toolbox.  I easily ran 12V to the box and I was able to mount these LED strips to the underside of the toolbox lid.  I have them connected to a normally open push button switch what powers them on when the lid opens.Although I like the white color, they offer easily changeable colors and brightness.  Even if power is cut to the little brain box, it remembers your last selection, so mine always power up nice, bright, and white.The strips adhere well and they are so thin I don't have to worry about them catching on anything.  I love these!", "overall": 5.0, "summary": "Super cool, super easy... installed these in my truck toolbox", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A1F7YU6O5RU432", "asin": "B00JGM7Z5Q", "reviewerName": "Angela Streiff", "helpful": [0, 0], "reviewText": "What an awesome idea this board is. It turns your stove top into a handy and very versatile cutting board surface. I didn't realize just how much extra space it gave me until I put to use.By having this bamboo stove top board setting over my burners, it frees up the space I usually use on my counter top with my regular cutting board. With that space free, I'm able to have that much more counter space when cooking, for everything from mixing bowls to food prep. My kitchen is petty small, and counter space is very limited. And on my limited counter space, I have all kinds of kitchen appliances. So I am forever trying to shift things around when I'm cooking. So this cutting board is perfect for my needs. It frees up some of my limited space and makes my whole stove into a giant work space.There are legs on the bottom of the board that you can attach to it and adjust to the height so it's best suited for your needs. Or you can even use this without the legs. However I find the board rests more stable when it sits on the legs, verses resting on the burners.The most complicated thing about this board is deciding where to keep it when you're not using it. It's so large that if you're getting this to help with limited kitchen space (like myself), you'll probably end up leaving it sitting on your stove top much of the time, and then just moving it when you need to use your burners. Alternatively you can keep it inside the oven (when it's not hot/turned on) and store it there while you use your stoves burners. I tend to do this and find it works well, since it's a perfect fit.", "overall": 5.0, "summary": "Turn you stove top into a giant cutting board", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
{"reviewerID": "A397CWU6DM3O5G", "asin": "B00JGM7Z5Q", "reviewerName": "ganka", "helpful": [1, 1], "reviewText": "The work surface is nice size, and built well. It is nice to be able to add some working space when needed. There are four legs underneath, and their position can be adjusted. They have rubber feet, and the screw supposed to be buried in the rubber entirely. It is not very obvious on the first sight, and the instructions provided are not clear with tiny fuzzy pictures - but if you take a leg apart - you will see there is indentation in the rubber for the screw head, so when installed correctly, metal would not stick out at all and the surface underneath would be completely safe from scratches.I was impressed by how carefully the thing was packed - with folded cardboard inserts to follow the shape of the board so it would be safe in transit.", "overall": 5.0, "summary": "The work surface is nice size, and built well", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
{"reviewerID": "A1M1Y5UGONAW06", "asin": "B00JGM7Z5Q", "reviewerName": "Jody", "helpful": [1, 1], "reviewText": "I have a small kitchen, so using the stove top as a work surface has become a way of life for me.  I was curious as to how the Camco 2 Burner Bamboo Work Surface would be better than a heavy wooden cutting board balanced across two burners.It is.  The legs were easily installed and just as easily adjusted to fit my burners.  I have a Fridgidaire gas stove and the burner grates are very large.  I was impressed that the legs of the Work Surface could accommodate them.  What it does is create a very stable surface and there's no danger of the thing slipping, tilting, or otherwise sending food flying.The thing is handsome looking, as well.  I understand bamboo is very durable, but will treat it periodically with mineral oil, just as I do my other wooden kitchen accoutrements like cutting boards and salad bowls.  Count me very impressed.This would make a great gift for someone living in a small apartment!", "overall": 5.0, "summary": "Wonderful kitchen asset!", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"}
{"reviewerID": "A3SD3E6FIS6CS9", "asin": "B00JGM7Z5Q", "reviewerName": "Marine Corps Nomad", "helpful": [0, 0], "reviewText": "If you've ever needed a little more work space in your kitchen, you will want to check out this bamboo stove top cover. We have a 4-burner gas stove, and it fit beautifully over the burners. Not only does it look great, but it also is fully functional as a cutting board or prep surface. It's easy to clean and durable.Originally, I had planned on trying this out in our travel trailer, but after setting it up (attaching the rubber legs), I put it on our stove in the house. My husband liked it so much that it's become a permanent addition to our inside kitchen. If we can find the right size, we'll probably be purchasing an additional one for the travel trailer.The bamboo stove cover has 4 rubber feet which you attach upon receipt of the unit. The unit itself measures 29.5&#34; X 21.25&#34;.  The rubber feet raise the work surface off the stove surface approximately 2&#34;. The front of the work surface has an approximately 1.75&#34; piece of bamboo which hides the burners from view. You need to make sure the burners are completely cool before using this. The groove around the outer portion of the bamboo work surface helps keep juices from overflowing onto the stove. It's easy to clean which is a must if you're using it as a cutting board.The bamboo stove top work surface is light weight, sturdy, and nice looking. It appears to be something that will last for a good while with proper care.", "overall": 5.0, "summary": "Beauty Meets Function", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
{"reviewerID": "A376OJHLE6SU9Q", "asin": "B00JGM7Z5Q", "reviewerName": "M. Wolf", "helpful": [0, 0], "reviewText": "Thin,light weightDurableBeautifulThis is a MUCH larger stove top cover than I would expect from Camco.  that plus much lighter.  The one I currently have in my RV is one heavy solid piece of wood that does not move when traveling.  I suspect the legs on this unit might help keep it in place if placed within the burner grates however it is still so light I would expect it to come off.  Also this is MUCH too large for my RV.What is is PERFECT for is to cover up a bad spot next to my skin on the kitchen counter!This cutting board has a very thin edge to it.  It also has a &#34;face&#34; or &#34;lip&#34; that butts up against the front edge of the counter.  This makes it a perfect cutting board to place over an unsightly area of counter top.", "overall": 5.0, "summary": "I love this for my home kitchen counter top", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
{"reviewerID": "A25QJBK33C4O0R", "asin": "B00JGM7Z5Q", "reviewerName": "terpfan1980 \"Barry\"", "helpful": [4, 8], "reviewText": "Wife 2.0 has never much cared for the kitchen in our home.  It's not that well laid out, but being in a mobile home, even if it's a double-wide, you don't get that much choice for how things get laid out.  Either way, we have a plethora of appliances and other semi-permanent residents on our counters (knife set, jars/canisters that hold the nylon cooking utensils, the Keurig brewer, the dish-strainer/drying rack, etc.) that leave things more cluttered than she'd prefer.  While it doesn't bother me that much to have to clean up between the various items that I'm prepping, nor to work in tighter quarters, I know it frustrates her, so seeing this item show up as something I might be able to test out and review, I jumped at the opportunity.I would note that it shipped inside of a box with plenty of cardboard above and below, and surrounding on either end, that should keep it from being damaged during shipping.  That box was shipped to me inside of another bigger box.  I'm not certain that would be the case for most purchasers, but if it is, then the outer box would be -- most definitely -- a waste of cardboard and paper.  Hopefully buyers recycle the box and materials.Also inside of the box was a small page of instructions.  Basically a single side of a single card that tells you to push the bolts down and through the legs so that the bolt heads can slide into the tracks on the bottom of this work surface.  Once that has been done, you might have to loosen the bolts up slightly, but then you should be able to slide the bolt heads down into the tracks and position the legs where you want them before tightening them back up.The legs are plastic and rubber/nylon combined.  A portion is plastic, while another portion is rubber/nylon.There's a warning carved into the underside of the work surface that notes that you cannot and should not put the work surface down on a hot stove surface.  The wood would be flammable and the legs could potentially melt or catch fire as well.Work surface wise, the 2 burner cover is relatively nice.  It offers a good amount of additional work surface and/or a nice cutting board area that can be used as desired.  Unfortunately it also cuts down by half (at least in my home's case) the amount of burner space you would have available in your home.  Worse, for me, is that if I place this work surface on my stove and intend to use the oven with whatever I'm preparing, I have to be careful again since the back of my gas stove gets quite warm in that area (it vents heat on the back of the stove top, behind the burner area, under the clock/control area).  Given how hot that area can get, it could be very dangerous to leave this work surface on top of the stove with the oven on and heated to higher temps.Even if the work surface can withstand the higher temps back on the back portion of the stove surface, I would still recommend being careful as any food items you work with there will be heated up and that could allow bacteria to multiply before you put food in the oven to cook it properly.Assuming you aren't going to run into these issues, or that you've been well informed about them or have thought about them yourself, then I don't see any reason not to recommend this item for purchase.  I can't say it would be perfect for everyone, but I think it serves a purpose and would do so relatively well.  4 stars from this reviewer.", "overall": 4.0, "summary": "Additional counter space, but have to be a little careful in use...", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"}
{"reviewerID": "A19UTUEBWKIZFT", "asin": "B00JGP8I1S", "reviewerName": "AKN", "helpful": [2, 2], "reviewText": "I live in a very sunny climate.  At least once per week, in the evenings at dusk, I have to drive with my hand shielding my eyes, straining to see the cars in front of me with bright sun streaming directly into my eyes. Crossing long bridges over open water with small curbs between me and the water below, and not being able to see, is risky and something I face frequently. So I consider this a necessity now that I know about it.This cuts out all glare.  It has a clip that fits over the visor.  The top sunshade flips down for daytime and a second one flips down over the first one for night.  It extends down far enough so that most of the viewing surface of the windshield is covered.  It blocks out none of the view.  It eliminates the dangerous glare from sun and oncoming headlights at night on a dark hiway.When you get this item there are removable films on each side of both visors and these need to be removed before you use it.  Reading some of the reviews it looks like some people were not aware of this and tried to use this with the protective films still on.  They are not noticeable when you receive this but you will definitely need to remove these before use.I still use my polarized sunglasses in the daytime which reduces about 70% of the glare, and this eliminates all the rest.  Those evening drives to the west with the sun's rays beaming directly into my eyes no longer bother me.  I consider this a necessity.  I'm delighted with it and grateful that I was given a  sample to try out in exchange for a review.", "overall": 5.0, "summary": "Stops the glare from sun or at night", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A1T1YSCDW0PD25", "asin": "B00JGP8I1S", "reviewerName": "A. Wiersch", "helpful": [0, 0], "reviewText": "This is an interesting product. It definitely has its pluses and minuses. I can see some people liking it and some people hating it.There is a certain benefit to looking through this visor. Things do seem a little easier to see and easier on the eyes however there are some potential issues:* Glare & reflections can be a problem (though using polarized sunglasses really cuts back on it)* Accidentally hitting it with certain arm movements can be annoying, and it may get in the way of using solar shields* Positioning it well takes a little effort but probably not a lot* Vibrations while driving can be distracting* Because it only covers part or your view when looking straight ahead, it might be distracting. When looking left or right there is no filter, but looking straight ahead there is. Some people might not mind this but I can see some people really not liking it.* You have to deal with possible dirt and smudges and cleaning it.. I would recommend keeping a nice micro-fiber cloth handy, and moving the visor by its edges to avoid fingerprintsOther:* Remember to remove the protective film covers before use.Because of the issues with it, I'm giving it 3 stars. You just have to try it to see if you like it. For me, I'm thinking a nice pair of polarized sunglasses is better.NOTE: I was sent a free product sample for review.", "overall": 3.0, "summary": "Good for some people, not for others", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
{"reviewerID": "A34BZM6S9L7QI4", "asin": "B00JGP8I1S", "reviewerName": "Candy Cane \"Is it just me?\"", "helpful": [2, 2], "reviewText": "This actually works pretty well. The yellow really makes things brighter at night, more crisp looking. And the brown lens is kind of like blue-blocker sunglasses for daytime.The reason I knock this one star is because I drive an FJ Cruiser, which is an SUV. The visor clip holds this too high on the windshield. Adjusting the visor downward kind of blocks my vision. I am 5'10, so it isn't a matter of me sitting too low in my seat, it really is that the visor in my truck is higher than in a car.I tried it in a friends Cadillac and it worked really well.Sample provided.", "overall": 4.0, "summary": "Not Great for SUV", "unixReviewTime": 1404604800, "reviewTime": "07 6, 2014"}
{"reviewerID": "AYB4ELCS5AM8P", "asin": "B00JGP8I1S", "reviewerName": "John B. Goode \"JBG\"", "helpful": [2, 2], "reviewText": "This is a vision visor for the car. It has two visors, one for day time and one for night time. Be sure to remove the plastic protection sheet on both sides of each visor (4 sheets in all). You flip them down one and a time or fold them up when not using them.The clip fits on my visor nicely and they are fairly stiff so you don't want to move them when you are driving as you'll need both hands to do it. The day time one does a good job of cutting down glare but it can be distracting as it doesn't cover everything, only what's in front of you. I've found the best time for using it is during rush hour when you're at a crawl or when you are stopped and the Sun is absolutely glaring at you. At that time, it's worth its weight in gold.The night time one is OK at reducing glare. Again, it's not for use at all times but when I'm driving down a certain one lane road where oncoming lights is a problem, it works great.It folds up fine but it prevents me from using the mirror in my visor and my second visor. My car has two visors so I can move one to the window. When I put this on, I can't use the second visor or the mirror.Overall, this is not a panacea but it's good for selective usage. As I mentioned, when you're sitting in a hot car or stopped on a freeway with a hot Sun this is absolutely what you want to have. Sample was provided for review purposes.", "overall": 5.0, "summary": "Works well for some situations...", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
{"reviewerID": "A1EVV74UQYVKRY", "asin": "B00JGP8I1S", "reviewerName": "K. Groh", "helpful": [1, 1], "reviewText": "I'm afraid I'm not sold on this. It does exactly what it says it should but it falls short in a few areas.It is really easy to clip on and flip down. I drive a minivan and found that it sat just a little too high for hitting the center of my vision. Which means that depending on the height of the person driving, it may or may not be in a good position. There is currently no way to adjust the height, just the angle.The daytime visor is good and is like looking though tinted sunglasses. I hate night glare so the night visor was also good for cutting that down.I just found that the size was limiting and I had to keep craning my neck to get it so that it wasn't a distraction but a natural part of looking through the windshield.I was provided a sample for testing and review.", "overall": 3.0, "summary": "Does What it Promises but Size is a Limitation", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00JGP8I1S", "reviewerName": "Nuknuk", "helpful": [2, 2], "reviewText": "It is a good sunshade for driving on bright sun.  It is not a polarizer but does its job well.  Easy install and easy to use.  Just flip it down and adjust to your preferred angle.  Make sure to center it for best coverage.Tip:Remove the plastic protectors on boths sides before use.Improvement I will suggest:- Another inch longer on the left and the right would be very useful- extendable arm so I can pull it down lowerA sample of this product was sent to me for review purposes.", "overall": 4.0, "summary": "Flipshade", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
{"reviewerID": "A3A4ZAIBQWKOZS", "asin": "B00JGP8I1S", "reviewerName": "Stephen M. Lerch", "helpful": [1, 1], "reviewText": "I received a visor set free for review purposes, and had I not received it for free, I never would have tried it.Now that I've tried it, I will say it works, but has some draw backs.One issue is that there is, no matter how you slice it, a small gap between the car visor and the HD Vision. You really have to keep your eyes focused in the area of the HD Vision to really get the impact.Another issue is surface area of the HD Vision. Don't get me wrong, the daylight visor and the night are good at reducing glare and could remove your need for sunglasses, except... you still have to look around yourself. This means when you look out of your window, look in your rear view mirror or elsewhere, you lose the effect. This means the usefulness is only for facing forwards. The only way to fix this would be to offer say, an adhesive film for the side windows and rear window.It's a nice idea. It's a flawed execution. In the end, I would say just wear sunglasses during the day and at night, well, the HD Vision is OK, but still has the same drawbacks as it has during the day.", "overall": 3.0, "summary": "works, but has limitations you may not want to compromise for", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
{"reviewerID": "A1RH7WA3YFDQ5H", "asin": "B00KIAQ8VW", "reviewerName": "Denise2012", "helpful": [0, 0], "reviewText": "Keeps the bugs out of your mouth while looking badass, this tubluar design as opposed to the hankerchief style is better wont flap up in your face and cover your neck", "overall": 5.0, "summary": "Great Item", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "A1PMV0WV45OPEE", "asin": "B00KIAQ8VW", "reviewerName": "Dwayne C.", "helpful": [0, 0], "reviewText": "I use them all the time when I ride or not I have order more just to have on hand when I got them I didn't think they would work but as I am all ways looking for things on line to help out", "overall": 4.0, "summary": "stretchable tubular", "unixReviewTime": 1387152000, "reviewTime": "12 16, 2013"}
{"reviewerID": "ACHBPQUWQZMSL", "asin": "B00KIAQ8VW", "reviewerName": "ernies point of veiw", "helpful": [0, 0], "reviewText": "i think this is a cool yet sweet looking half skull mask and is what it is and thats simply cool", "overall": 5.0, "summary": "wanna look cool then buy this you will love it", "unixReviewTime": 1384819200, "reviewTime": "11 19, 2013"}
{"reviewerID": "A1TEBSNK5A9XX9", "asin": "B00KIAQ8VW", "reviewerName": "JUL", "helpful": [0, 0], "reviewText": "I honestly don't think it's worth $3, but for fun it's ok. I bought one for me in my motorcycle and a few for the kids just because of the image.", "overall": 3.0, "summary": "It's ok fo the money?", "unixReviewTime": 1394841600, "reviewTime": "03 15, 2014"}
{"reviewerID": "A212UJA6XIOTUT", "asin": "B00KIAQ8VW", "reviewerName": "kaz", "helpful": [0, 0], "reviewText": "very thin material. not very warm at all.. barley breaks the wind and on a cold day is pretty much useless.. not for winter sports", "overall": 2.0, "summary": "ehhhh", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "A1KB43BI085A48", "asin": "B00KIAQ8VW", "reviewerName": "Mike F.", "helpful": [1, 1], "reviewText": "I've bought 10 of these over the past year to give as gifts to friends and club brothers, and have had no reports of wear issues, flaws, manufacturing defects or discomfort.  They work extremely well, and I wouldn't hesitate to buy them again.", "overall": 5.0, "summary": "Excellent quality for the price", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"}
{"reviewerID": "A3HIUWKL4D853W", "asin": "B00KIAQ8VW", "reviewerName": "RayH", "helpful": [0, 0], "reviewText": "OK, I have to admit, the price of this item did not have my expectations unfairly high.  It is a straight tube neck/face cover with a whimsical lower skull image on both front and back.  Material is stretchy and easily pulls up over the face.  However the material does not &#34;breath&#34; very well and condensation from your breath builds up moisture on your face and will steam up glasses if you wear them (even sunglasses and open goggles).  There is no hem around either end of the tube (guess a strecthy thread was not considered) and the material has started to fray a bit.  For the price, this is a cute novelty item, but not what I really need it for.  I have spent a few  more bucks on a better quality one and awaiting that one to see if it works better with the condensation issue.  As for THIS seller; be aware that this is an INTERNATIONAL ORDER (China I suspect) although it is not listed in the posting.  This equated to a very delayed delivery date (exceeded the estimated delivery date considerably).  If you want a &#34;novelty&#34; item that you aren't going to wear long, this one is OK.  If you want one you can wear for wind and cold protection without a lot of condensation building up on your face, spend a few bucks for a better one.", "overall": 2.0, "summary": "Light weight neck and face cover with whimsical design.", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}
{"reviewerID": "A1S95WASXJ02VX", "asin": "B00KIAQ8VW", "reviewerName": "Roberto Aguilar Jr.", "helpful": [0, 0], "reviewText": "I love my skull face mask. It makes me outstand from the rest of my fellow riders. Everybody wants to have one. Every where I go they are over priced. Order it and give it as a guiff. It is really cool.", "overall": 5.0, "summary": "I love to ride with my Skull Face Mask.", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
{"reviewerID": "A2IID0Z6EHF5KP", "asin": "B00KIAQ8VW", "reviewerName": "Soarer", "helpful": [0, 0], "reviewText": "This mask of course as described is half-face but with a long protection for neck.  It's great to cut the wind out with a jacket to keep this tucked.", "overall": 5.0, "summary": "Great neck protection", "unixReviewTime": 1357171200, "reviewTime": "01 3, 2013"}
{"reviewerID": "A3HKZTFCPIK2OE", "asin": "B00KIAQ8VW", "reviewerName": "SSG Barnes (ABN) \"James C. Barnes\"", "helpful": [0, 0], "reviewText": "Good light weight for just cool nights or rain in a half helmet. Almost like not wearing one it is so light.", "overall": 5.0, "summary": "FACE MASK", "unixReviewTime": 1395100800, "reviewTime": "03 18, 2014"}
